Revit 2024 API
SchemaBuilder.SetSchemaName Method
 Sets the name of the Schema.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public SchemaBuilder SetSchemaName(
	string schemaName
)
Visual Basic
Public Function SetSchemaName ( _
	schemaName As String _
) As SchemaBuilder
Visual C++
public:
SchemaBuilder^ SetSchemaName(
	String^ schemaName
)
Parameters
schemaName
Type: System.String
 The name for the Schema.
Return Value
 The SchemaBuilder object may be used to add more settings.
Remarks
 The name is a user-friendly identifier of the Schema. GUIDs are used exclusively for Schema identity, but the name is useful to identify the Schema during development or in an error message. This field is required.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The parameter schemaName is not acceptable for naming Extensible Storage objects.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The SchemaBuilder has already finished building the Schema.
See Also
SchemaBuilder Class
Autodesk.Revit.DB.ExtensibleStorage Namespace